src/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоОтключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКомпоненты</Name>
					<Comment>Версия компоненты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПодключаемоеОборудование/Forms/ФормаНастройкиMANGO/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='Оборудование:'") + Символы.НПП  + Строка(Идентификатор);
	
	времПорт            	= Неопределено;
	времСервер          	= Неопределено;
	времКодПродукта        	= Неопределено;
	времКлюч	        	= Неопределено;
	времСтруктурнаяЕдиница 	= Неопределено;
	времАдресПубликации     = Неопределено;

	Параметры.ПараметрыОборудования.Свойство("Сервер"          		, времСервер);
	Параметры.ПараметрыОборудования.Свойство("Порт"            		, времПорт);
	Параметры.ПараметрыОборудования.Свойство("КодПродукта"     	 	, времКодПродукта);
	Параметры.ПараметрыОборудования.Свойство("Ключ"          		, времКлюч);
	Параметры.ПараметрыОборудования.Свойство("СтруктурнаяЕдиница"	, времСтруктурнаяЕдиница);
	Параметры.ПараметрыОборудования.Свойство("АдресПубликации"    	, времАдресПубликации);	
	
	Сервер          	= ?(времСервер	        = Неопределено,   "https://app.mango-office.ru/vpbx"	, времСервер);
	Порт            	= ?(времПорт            = Неопределено,   80			, времПорт);
	КодПродукта        	= ?(времКодПродукта     = Неопределено,   ""			, времКодПродукта);
	Ключ	          	= ?(времКлюч	        = Неопределено,   ""			, времКлюч);
	СтруктурнаяЕдиница 	= ?(времСтруктурнаяЕдиница = Неопределено, Неопределено	, времСтруктурнаяЕдиница);
	АдресПубликации     = СменитьПубликацию(Ложь);
	
	Если ПроверитьПодключениеВнешнейСистемы(Перечисления.ТипыВнешнихСистем.IPТелефония) Тогда
		ИспользоватьРетранслятор = Истина;
		АдресПубликации = СменитьПубликацию(Истина); 
	Иначе
		ИспользоватьРетранслятор = Ложь;		
	КонецЕсли; 	
	
	Параметры.ПараметрыОборудования.Свойство("КоллтрекингАдресСервера", КоллтрекингАдресСервера);
	Параметры.ПараметрыОборудования.Свойство("КоллтрекингToken"   	  , КоллтрекингToken);
	Параметры.ПараметрыОборудования.Свойство("КоллтрекингНомерВиджета", КоллтрекингНомерВиджета);	
	Параметры.ПараметрыОборудования.Свойство("ИспользоватьКоллтрекинг", ИспользоватьКоллтрекинг);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("Сервер"                 , Сервер);
	НовыеЗначениеПараметров.Вставить("Порт"                   , Порт);
	НовыеЗначениеПараметров.Вставить("КодПродукта"            , КодПродукта);
	НовыеЗначениеПараметров.Вставить("Ключ"			          , Ключ);
	НовыеЗначениеПараметров.Вставить("СтруктурнаяЕдиница"     , СтруктурнаяЕдиница);
	НовыеЗначениеПараметров.Вставить("АдресПубликации"        , АдресПубликации);	
	НовыеЗначениеПараметров.Вставить("ИспользоватьКоллтрекинг", ИспользоватьКоллтрекинг);
	НовыеЗначениеПараметров.Вставить("КоллтрекингАдресСервера", КоллтрекингАдресСервера);
	НовыеЗначениеПараметров.Вставить("КоллтрекингНомерВиджета", КоллтрекингНомерВиджета);
	НовыеЗначениеПараметров.Вставить("КоллтрекингToken"       , КоллтрекингToken);

	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключено к ретранслятору при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ИспользоватьРетрансляторПриИзменении(Элемент)
	
	ОписаниеОшибки   = "";
	ВыполненоУспешно = Ложь;
	Модифицированность = Истина;
	
	ДопПараметры = Новый Структура("operator_IP_telephony", "MANGO");
	
	Если ИспользоватьРетранслятор Тогда 
		
		ВыполненоУспешно = ПодключитьВнешнююСистему(ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.IPТелефония"), ОписаниеОшибки, ДопПараметры);	
		
		Если ВыполненоУспешно Тогда			
			АдресПубликации = СменитьПубликацию(Истина);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Источники заявок: " + ОписаниеОшибки); 		
		КонецЕсли;
		
	Иначе		
		
		ВыполненоУспешно = ОтключитьВнешнююСистему(ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.IPТелефония"), ОписаниеОшибки, ДопПараметры);
		
		Если ВыполненоУспешно Тогда  			
			АдресПубликации = СменитьПубликацию(Ложь);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Источники заявок: " + ОписаниеОшибки); 		
		КонецЕсли;
		
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	
	ОчиститьСообщения();
	СообщениеОшибки  = "";
	
	Результат = IPТелефония.MANGO_ТестированиеСервера(Сервер, Порт, КодПродукта, Ключ, СообщениеОшибки);
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден. Ошибка:" + Символы.ПС + " %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", СообщениеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТескКоллтрекинга(Команда)
	
	Если Не ИспользоватьКоллтрекинг Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Коллтрекинг не используется. Необходимо включить.");
	КонецЕсли;
	
	КоллтрекингАдресСервера = СтрЗаменить(КоллтрекингАдресСервера, "https://", "");
		
	СообщениеОшибки = "";
	Результат = IPТелефония.MANGO_ТестированиеКоллтрекинга(КоллтрекингАдресСервера, КоллтрекингToken, КоллтрекингНомерВиджета, СообщениеОшибки);
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден. Ошибка:" + Символы.ПС + " %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", СообщениеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура, ПолучитьВнешнююСистему.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Функция ПроверитьПодключениеВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат ЗначениеЗаполнено(Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы));

КонецФункции

&НаСервере
// Функция - Подключить внешнюю систему.
// 
Функция ПодключитьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Истина, ОписаниеОшибки, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат СоздатьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки, ДополнительныеПараметры);
	
КонецФункции

&НаСервере
// Функция - Отключить внешнюю систему.
// 
Функция ОтключитьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда 		
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Ложь, ОписаниеОшибки, ДополнительныеПараметры);
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
// Функция - Создать внешнюю систему.
//
Функция СоздатьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема   = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(ТипВнешнейСистемы,,,КодПродукта);
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();	
	РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, УидСессии,,, ДополнительныеПараметры);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Ложь, Ложь);
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
	Иначе
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Истина, Истина);
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
			
КонецФункции

&НаСервереБезКонтекста
// Функция, включает/отключает внешнюю систему.
//
Функция ОбновитьВнешнююСистему(ВнешняяСистема, Используется = Истина, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();		
	РезультатЗапроса = ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется, УидСессии,,, ДополнительныеПараметры);		
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Используется, Используется);				
	Иначе	
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;	
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
		
КонецФункции

&НаСервереБезКонтекста
// Процедура - Сменить публикацию
//
Функция СменитьПубликацию(Флаг = Ложь)
	
	АдресРетранслятора  = "http://cloud.stoma1c.ru/api";
	HTTPСервис = "/hs/Click2Call";
	//HTTPСервис = СтрЗаменить(HTTPСервис, "{apikey}", ПолучитьВнешнююСистему());	
	
	Если Флаг Тогда
		Возврат "" + АдресРетранслятора + HTTPСервис;
	Иначе 
		АдресПубликации = Константы.ВнешняяПубликацияАдрес.Получить();		
		АдресПубликации = СокрЛП(АдресПубликации);
		АдресПубликации = ?(СтрЗаканчиваетсяНа(АдресПубликации, "/"),  Лев(АдресПубликации, СтрДлина(АдресПубликации)-1), АдресПубликации);
		Возврат "" + АдресПубликации + HTTPСервис;
	КонецЕсли;		
	
КонецФункции

#КонецОбласти
